cases/subsonic/Lambert/J20/setup/constant/sprayCloudProperties.withSamplers
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sprayCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// Lambert (ILASS 2019) — J=10, We=1500
// sigma_JetA1 = 0.0225 N/m a 300 K
//
// Iniezione: D_jet=457 um, u_jet=30.4 m/s (J=10 con rho_l=801.8, rho_g=5.884)
//   Q = 30.4 * pi/4 * (0.000457)^2 = 4.98e-6 m^3/s
//   mdot = 800 * 4.98e-6 = 3.99e-3 kg/s
//   massTotal = 3.99e-3 * 0.02 s = 7.98e-5 kg
//
// Parametri breakup (Lambert 2019 Fig.6 caption):
//   C0=3.44, B0=2.44, B1=10, FLig=0.4
//   CD_blob=1.48 (Madabhushi 2003), CD_disc=1.2
//

solution
{
    active                      true;
    coupled                     true;
    transient                   yes;
    cellValueSourceCorrection   on;
    maxCo                       0.3;
    nSubCycles                  1;

    // Write Cartesian (x,y,z) positions — required for Python post-processing
    writePositionFormat         xyz;

    sourceTerms
    {
        schemes
        {
            rho         semiImplicit 1;
            U           semiImplicit 1;
            h           semiImplicit 1;
            radiation   explicit 1;
        }
    }

    interpolationSchemes
    {
        rho         cell;
        U           cell;
        thermo:mu   cell;
        T           cell;
        Cp          cell;
        kappa       cell;
        p           cell;
    }

    integrationSchemes
    {
        U   analytical;
        T   analytical;
    }
}

constantProperties
{
    T0              300;        // Lambert: T_gas = 300 K
    rho0            801.8;      // Jet-A1 density [kg/m^3]
    Cp0             2066.75;       // Jet-A1 / n-decane Cp at 300 K [J/kg/K]
    constantVolume  false;
}

subModels
{
    // -----------------------------------------------------------------
    // DRAG: Madabhushi (2003)
    // CD_blob = 1.48 (Madabhushi 2003: liquid column regime)
    // CD_disc = 1.2  (Madabhushi 2003 / Lambert 2019)
    // C0 = 3.44      (Lambert 2019 Eq.1)
    // -----------------------------------------------------------------
    particleForces
    {
        MadabhushiDragForce
        {
            CdBlob  1.48;
            CdDisc  1.2;
            C0      3.44;
            Dinj    0.000457;   // D_jet Lambert = 457 um
            debug   false;
        }
        gravity;
    }

    // -----------------------------------------------------------------
    // INIEZIONE: Lambert (ILASS 2019)
    // D_jet = 457 um, injector at (x=0.02m, y=0, z=0) — bottom wall centerline
    // direction = +y (jet perpendicular to crossflow)
    // half-cone angle = 10 deg (Lambert 2019: "solid cone, half-angle 10°")
    // J=10: u_jet = 30.4 m/s, Q = 4.98e-6 m^3/s
    // -----------------------------------------------------------------
    injectionModels
    {
        model1
        {
            type                coneNozzleInjection;

            SOI                 0.01;       // inject after initial flow dev.
            duration            0.02;       // total injection duration [s]

            massTotal           7.98e-5;    // mdot * duration = 3.99e-3 * 0.02

            parcelBasisType     mass;
            parcelsPerSecond    1000000;
            minParticlesPerParcel 1e-7;

            injectionMethod     disc;
            outerDiameter       0.000457;   // D_jet = 457 um
            innerDiameter       0.0;

            position            (0.02 0.0 0.0);  // 0.02 m from air inlet, centerline
            direction           (0 1 0);          // +y: jet perpendicular to crossflow

            flowType            flowRateAndDischarge;
            Cd                  constant 1;

            flowRateProfile     constant 4.98e-6;  // Q = u_jet * A_jet [m^3/s]

            thetaInner          constant 0.0;
            thetaOuter          constant 10.0;    // Lambert 2019: solid cone 10 deg

            sizeDistribution
            {
                type    fixedValue;
                fixedValueDistribution
                {
                    // D0 = D_jet: blob injection (Madabhushi 2003)
                    value   0.000457;
                }
            }
        }
    }

    dispersionModel             stochasticDispersionRAS;
    stochasticDispersionRASCoeffs {}

    patchInteractionModel       localInteraction;

    heatTransferModel           RanzMarshall;

    compositionModel            singlePhaseMixture;
    phaseChangeModel            none;
    surfaceFilmModel            none;
    atomizationModel            none;

    // -----------------------------------------------------------------
    // BREAKUP: Madabhushi + Lambert enhancement
    // C0=3.44, B0=2.44, B1=10 (Lambert 2019 Fig.6 caption)
    // FLig=0.4 (Lambert 2019 Eq.11)
    // -----------------------------------------------------------------
    breakupModel    Madabhushi;

    MadabhushiCoeffs
    {
        C0      3.44;       // column breakup time constant (Lambert 2019 Eq.1)
        FLig    0.4;        // ligament factor (Lambert 2019 Eq.11)
        b0      2.44;       // Wave model B0 (Lambert 2019 Fig.6)
        b1      10;         // Wave model B1 (Lambert 2019 Fig.6)
        Dinj    0.000457;   // D_jet = 457 um
        nChildren 5;        // Madabhushi (2003): five child parcels
        debug   false;
    }

    stochasticCollisionModel    trajectory;

    radiation                   off;

    RanzMarshallCoeffs  { BirdCorrection true; }
    trajectoryCoeffs
    {
        cSpace          1;
        cTime           1;
        coalescence     on;
    }

    singlePhaseMixtureCoeffs
    {
        phases
        (
            liquid { C10H22 1; }
        );
    }

    localInteractionCoeffs
    {
        patches
        (
            inlet       { type escape; }
            outletRight { type escape; }
            wallTop     { type stick; }
            wallBottom  { type stick; }
            front       { type escape; }
            back        { type escape; }
        );
    }
}

cloudFunctions
{
    WeberNumber1    { type WeberNumber;    }
    ReynoldsNumber1 { type ReynoldsNumber; }

    parcelPlaneSampler_30d
    {
        type                        parcelPlaneSampler;
        active false;
        polygons
        (
            (
                ( 0.033937 0.0   -0.025 )
                ( 0.033937 0.05  -0.025 )
                ( 0.033937 0.05   0.025 )
                ( 0.033937 0.0    0.025 )
            )
        );
        normal                      (1 0 0);
        log                         yes;
        negateParcelsOppositeNormal false;
    }

    parcelPlaneSampler_60d
    {
        type                        parcelPlaneSampler;
        active false;
        polygons
        (
            (
                ( 0.047310 0.0   -0.025 )
                ( 0.047310 0.05  -0.025 )
                ( 0.047310 0.05   0.025 )
                ( 0.047310 0.0    0.025 )
            )
        );
        normal                      (1 0 0);
        log                         yes;
        negateParcelsOppositeNormal false;
    }
}
// ************************************************************************* //
